# -*- coding: utf-8 -*-
"""
Задание 7.1

Обработать строки из файла ospf.txt и вывести информацию по каждой строке в таком
виде на стандартный поток вывода:

Prefix                10.0.24.0/24
AD/Metric             110/41
Next-Hop              10.0.13.3
Last update           3d18h
Outbound Interface    FastEthernet0/0

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

template = """Prefix                {}
AD/Metric             {}
Next-Hop              {}
Last update           {}
Outbound Interface    {}"""

with open('ospf.txt') as f:
    for line in f:
        commands = line.split()
        prefix = commands[1]
        adm_dist = commands[2].strip('[]')
        n_hop = commands[4].replace(',', '')
        l_upd = commands[5].replace(',', '')
        out_intf = commands[6]
        print(template.format(prefix, adm_dist, n_hop, l_upd, out_intf), sep = '')

f.close()
